Autodesk.Revit.DB.LayerCategoryType
Since:
2014
An enumerated type listing category types supported in an ExportLayerTable.
Since:
2014

Autodesk.Revit.DB.LayerCategoryType.Modifier
A special value related to modifiers.

Autodesk.Revit.DB.LayerCategoryType.Imported
Imported categories.

Autodesk.Revit.DB.LayerCategoryType.AnalyticalModel
AnalyticalModel categories.

Autodesk.Revit.DB.LayerCategoryType.Annotation
Annotation categories.

Autodesk.Revit.DB.LayerCategoryType.Model
Model categories.

Autodesk.Revit.DB.LayerCategoryType.Unsorted
A default unsorted type.